{
  "architectures": [
    "SiglipForImageClassification"
  ],
  "dtype": "float32",
  "id2label": {
    "0": "a",
    "1": "b",
    "2": "c",
    "3": "d",
    "4": "e",
    "5": "f",
    "6": "g",
    "7": "h",
    "8": "i",
    "9": "k",
    "10": "l",
    "11": "m",
    "12": "n",
    "13": "o",
    "14": "p",
    "15": "q",
    "16": "r",
    "17": "s",
    "18": "t",
    "19": "u",
    "20": "v",
    "21": "w",
    "22": "x",
    "23": "y"
  },
  "initializer_factor": 1.0,
  "label2id": {
    "a": 0,
    "b": 1,
    "c": 2,
    "d": 3,
    "e": 4,
    "f": 5,
    "g": 6,
    "h": 7,
    "i": 8,
    "k": 9,
    "l": 10,
    "m": 11,
    "n": 12,
    "o": 13,
    "p": 14,
    "q": 15,
    "r": 16,
    "s": 17,
    "t": 18,
    "u": 19,
    "v": 20,
    "w": 21,
    "x": 22,
    "y": 23
  },
  "model_type": "siglip",
  "problem_type": "single_label_classification",
  "text_config": {
    "attention_dropout": 0.0,
    "bos_token_id": 49406,
    "dtype": "float32",
    "eos_token_id": 49407,
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 768,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-06,
    "max_position_embeddings": 64,
    "model_type": "siglip_text_model",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "pad_token_id": 1,
    "projection_size": 768,
    "vocab_size": 256000
  },
  "transformers_version": "5.3.0",
  "vision_config": {
    "attention_dropout": 0.0,
    "dtype": "float32",
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 768,
    "image_size": 224,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-06,
    "model_type": "siglip_vision_model",
    "num_attention_heads": 12,
    "num_channels": 3,
    "num_hidden_layers": 12,
    "patch_size": 16
  }
}
